# 1757. Recyclable and Low Fat Products
##### February 02, 2026

## Table: Products

| Column Name | Type    |
| -------- | ------- |
| product_id  | int     |
| low_fats    | enum    |
| recyclable  | enum    |


- `product_id` is the primary key (column with unique values) for this table.
- `low_fats` is an ENUM (category) of type ('Y', 'N') where 'Y' means this product is low fat and 'N' means it is not.
- `recyclable` is an ENUM (category) of types ('Y', 'N') where 'Y' means this product is recyclable and 'N' means it is not.
 

Write a solution to find the ids of products that are both low fat and recyclable.

Return the result table in any order.

The result format is in the following example.

Example 1:

Input: 
Products table:
| product_id  | low_fats | recyclable |
| -------- | ------- | ------- |
| 0           | Y        | N          |
| 1           | Y        | Y          |
| 2           | N        | Y          |
| 3           | Y        | Y          |
| 4           | N        | N          |


Output: 

| product_id  |
| -------- | 
| 1           |
| 3           |

Explanation: Only products 1 and 3 are both low fat and recyclable.

> ### SQL Solution

#### Algorithm

- Select `product_id` from the `Products` table.
- Filter rows where:
    - `low_fats` = `'Y'` and
    - `recyclable = 'Y'`
- Return the filtered result.

##### Sol

```sql
select * 
from product
where low_fats = 'Y' and
      recyclable = 'Y'
```

> ### Python Solution

#### Algorithm

- Filter the Products DataFrame to keep rows where low_fats == 'Y' and recyclable == 'Y'.
- Select only the product_id column from the filtered DataFrame.
- Return the result.

##### Sol

In [23]:
# Scheme
import pandas as pd
data = [['0', 'Y', 'N'], ['1', 'Y', 'Y'], ['2', 'N', 'Y'], ['3', 'Y', 'Y'], ['4', 'N', 'N']]
products = pd.DataFrame(data, columns=['product_id', 'low_fats', 'recyclable']).astype({'product_id':'int64', 'low_fats':'category', 'recyclable':'category'})
products

   product_id low_fats recyclable
0           0        Y          N
1           1        Y          Y
2           2        N          Y
3           3        Y          Y
4           4        N          N

In [24]:
def find_products(products: pd.DataFrame) -> pd.DataFrame:
    df = products[(products.low_fats == 'Y') & (products.recyclable == 'Y')][['product_id']]
    return df

find_products(products)

   product_id
1           1
3           3

# 584. Find Customer Referee
##### February 03, 2026

## Table: Customer

| Column Name | Type    |
|----------|-----------|
| id          | int     |
| name        | varchar |
| referee_id  | int     |

In SQL, `id` is the primary key column for this table.
Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
 

Find the names of the customer that are either:

1. referred by any customer with `id != 2`.
2. not referred by any customer.
Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
Customer table:

| id | name | referee_id |
|----|------|------------|
| 1  | Will | null       |
| 2  | Jane | null       |
| 3  | Alex | 2          |
| 4  | Bill | null       |
| 5  | Zack | 1          |
| 6  | Mark | 2          |

Output: 

| name |
|------|
| Will |
| Jane |
| Bill |
| Zack |

> ### SQL Solution

#### Algorithm

- filter the customers where the `referee_id` is `null`
- or filter the customers on `refree_id` is not 2
- select only the `name` column from table `Customer`

##### Sol

```sql
select name 
from Customer
where referee_id is null 
      or referee_id != 2
```

> ### Python Solution

#### Algorithm
- filter the dataframe using `OR` opretor for two conditions:
 + `referee_id` is `null`
 + `referee_is` is not `2`
- return only the `name` column

##### Sol

In [25]:
data = [[1, 'Will', None], [2, 'Jane', None], [3, 'Alex', 2], [4, 'Bill', None], [5, 'Zack', 1], [6, 'Mark', 2]]
customer = pd.DataFrame(data, columns=['id', 'name', 'referee_id']).astype({'id':'Int64', 'name':'object', 'referee_id':'Int64'})
customer

   id  name  referee_id
0   1  Will        <NA>
1   2  Jane        <NA>
2   3  Alex           2
3   4  Bill        <NA>
4   5  Zack           1
5   6  Mark           2

In [26]:
filtered_df = customer[(customer.referee_id!=2)|(customer.referee_id.isna())]
filtered_df[['name']]

   name
0  Will
1  Jane
3  Bill
4  Zack

# 595. Big Countries
##### February 04,2026

## Table: World

| Column Name | Type    |
|-------------|---------|
| name        | varchar |
| continent   | varchar |
| area        | int     |
| population  | int     |
| gdp         | bigint  |

`name` is the primary key (column with unique values) for this table.
Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
 

A country is big if:

- it has an `area` of at least three million (i.e., 3000000 km2), or
- it has a `population` of at least twenty-five million (i.e., 25000000).

Write a solution to find the `name`, `population`, and `area` of the big countries.

Return the result table in any order.

The result format is in the following example.

 

Example 1:

Input: 
World table:
| name        | continent | area    | population | gdp          |
|-------------|-----------|---------|------------|--------------|
| Afghanistan | Asia      | 652230  | 25500100   | 20343000000  |
| Albania     | Europe    | 28748   | 2831741    | 12960000000  |
| Algeria     | Africa    | 2381741 | 37100000   | 188681000000 |
| Andorra     | Europe    | 468     | 78115      | 3712000000   |
| Angola      | Africa    | 1246700 | 20609294   | 100990000000 |


Output: 
| name        | population | area    |
|-------------|------------|---------|
| Afghanistan | 25500100   | 652230  |
| Algeria     | 37100000   | 2381741 |

> ### SQL Solution

#### Algorithm
- Filter the results using where clause for either of the conditions
    + area >= 3000000
    + population >= 25000000
- select columns - `name`,`population`,`area`

##### Sol

```sql
select name, population, area
from World
where area >= 3000000
      or population >= 25000000
```

> ### Python Solution

#### Algorithm
- Filter the dataframe if weither one conditions satisfies:
    + area >= 3000000
    + population >= 25000000
- Return olny name, population, area column

##### Sol

In [6]:
# Write your code here
data = [['Afghanistan', 'Asia', 652230, 25500100, 20343000000], ['Albania', 'Europe', 28748, 2831741, 12960000000], ['Algeria', 'Africa', 2381741, 37100000, 188681000000], ['Andorra', 'Europe', 468, 78115, 3712000000], ['Angola', 'Africa', 1246700, 20609294, 100990000000]]
world = pd.DataFrame(data, columns=['name', 'continent', 'area', 'population', 'gdp']).astype({'name':'object', 'continent':'object', 'area':'Int64', 'population':'Int64', 'gdp':'Int64'})
world

          name continent     area  population           gdp
0  Afghanistan      Asia   652230    25500100   20343000000
1      Albania    Europe    28748     2831741   12960000000
2      Algeria    Africa  2381741    37100000  188681000000
3      Andorra    Europe      468       78115    3712000000
4       Angola    Africa  1246700    20609294  100990000000

In [15]:
filtered_df = world[
                    (world.area >= 3000000) |
                    (world.population >= 25000000)
                    ]
filtered_df[['name','population','area']]

          name  population     area
0  Afghanistan    25500100   652230
2      Algeria    37100000  2381741

# 1148. Article Views I
##### February 05,2026

## Table: Views

| Column Name   | Type    |
|---------------|---------|
| article_id    | int     |
| author_id     | int     |
| viewer_id     | int     |
| view_date     | date    |


There is no primary key (column with unique values) for this table, the table may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.
 

Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.

The result format is in the following example.

Example 1:

Input: 
Views table:
| article_id | author_id | viewer_id | view_date  |
|------------|-----------|-----------|------------|
| 1          | 3         | 5         | 2019-08-01 |
| 1          | 3         | 6         | 2019-08-02 |
| 2          | 7         | 7         | 2019-08-01 |
| 2          | 7         | 6         | 2019-08-02 |
| 4          | 7         | 1         | 2019-07-22 |
| 3          | 4         | 4         | 2019-07-21 |
| 3          | 4         | 4         | 2019-07-21 |

Output: 
| id   |
|------|
| 4    |
| 7    |

> ### SQL Solution

#### Algorithm
- filter table based on where author_id = viewer_id
- get unique author_id
- rename the column to `id`
- select only `id`
- order by `id` asc

##### Sol

```sql
select distinct author_id as id
from Views
where author_id = viewer_id
order by id
```

> ### Python Solution

#### Algorithm

##### Sol

In [2]:
# Write your code here
data = [[1, 3, 5, '2019-08-01'], [1, 3, 6, '2019-08-02'], [2, 7, 7, '2019-08-01'], [2, 7, 6, '2019-08-02'], [4, 7, 1, '2019-07-22'], [3, 4, 4, '2019-07-21'], [3, 4, 4, '2019-07-21']]
views = pd.DataFrame(data, columns=['article_id', 'author_id', 'viewer_id', 'view_date']).astype({'article_id':'Int64', 'author_id':'Int64', 'viewer_id':'Int64', 'view_date':'datetime64[ns]'})
views

   article_id  author_id  viewer_id  view_date
0           1          3          5 2019-08-01
1           1          3          6 2019-08-02
2           2          7          7 2019-08-01
3           2          7          6 2019-08-02
4           4          7          1 2019-07-22
5           3          4          4 2019-07-21
6           3          4          4 2019-07-21

In [15]:
def article_views(views: pd.DataFrame) -> pd.DataFrame:
    df = views[(views.author_id) == (views.viewer_id)]
    df = df.drop_duplicates(subset = 'author_id')
    df.rename(columns= {'author_id':'id'}, inplace = True)
    df.sort_values('id', inplace = True)
    return df[['id']]

# Topic
##### Date

## Question

> ### SQL Solution

#### Algorithm

##### Sol

```sql

```

> ### Python Solution

#### Algorithm

##### Sol

In [17]:
# Write your code here

# Topic
##### Date

## Question

> ### SQL Solution

#### Algorithm

##### Sol

```sql

```

> ### Python Solution

#### Algorithm

##### Sol

In [17]:
# Write your code here

# Topic
##### Date

## Question

> ### SQL Solution

#### Algorithm

##### Sol

```sql

```

> ### Python Solution

#### Algorithm

##### Sol

In [17]:
# Write your code here